1s/ERP/Conf/Documents/Лико_УстановкаРезерваМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_УстановкаРезерваМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_РезервСерий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвердил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_ОбъектРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаработкаТекущейОперации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримечаниеПоНаработке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНастроечногоМатериала</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ВидыНастроечногоМатериала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_РезервСерий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_РезервСерий</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_ОбъектРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбъектНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_УстановкаРезерваМатериалов/Ext/ObjectModule.bsl
Процедура ПередЗаписьюБезРегионов(Отказ, РежимЗаписи, РежимПроведения)
	
	НомерСтроки=0;
	
	Для каждого Товар Из Товары Цикл
		ОбъектНоменклатуры=Товар.Серия.ЯССМ_ОбъектНоменклатуры;
		
		
		Если ОбъектНоменклатуры.Уникальный И 
			ОбъектНоменклатуры.Партнер <> Партнер И 
			ЗначениеЗаполнено(ОбъектНоменклатуры.Партнер) И 
			ЗначениеЗаполнено(Партнер) Тогда
			Отказ=Истина; 			
			
						
			
			ОбъектНоменклатуры_Партнер=ОбъектНоменклатуры.Партнер;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Материал: №%3 (%1) - %2 - #%4, необходимо снять с резерва: ""%5""!",
			Товар.Номенклатура.Код,
			Товар.Номенклатура,
			НомерСтроки+1,
			Формат(ОбъектНоменклатуры.НомерПоставки,"ЧДЦ=0; ЧГ="),
			ОбъектНоменклатуры_Партнер);
			Сообщение.Поле = "Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить();  				
			
		КонецЕсли;	
		НомерСтроки=НомерСтроки+1;
		
	КонецЦикла;
	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	Для каждого Товар Из Ссылка.Товары Цикл
		
		Если Товар.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный Тогда
			
			НоваяСтрТз						=	ТЗ.Добавить();			 
			НоваяСтрТз.ОбъектНоменклатуры	= 	Товар.Серия.ЯССМ_ОбъектНоменклатуры;
			
		КонецЕсли;		
	КонецЦикла;
	
	ДополнительныеСвойства.Вставить("ТЗ_ОбъектыНоменклатуры",ТЗ); 
	                                                                                                                            
	ДополнительныеСвойства.Вставить("ОтменаРезерва",
	(Режимзаписи=РежимЗаписиДокумента.ОтменаПроведения И Ссылка.Проведен) Или 
	(Режимзаписи=РежимЗаписиДокумента.Проведение И Не ЗначениеЗаполнено(Партнер) И ЗначениеЗаполнено(Ссылка.Партнер)));

	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

		
	
	Если Не Документы.Лико_УстановкаРезерваМатериалов.СтартРезевированияПодРегионы() Тогда
		
		ПередЗаписьюБезРегионов(Отказ, РежимЗаписи, РежимПроведения);
		
		Возврат;
		
	КонецЕсли;

	
	НомерСтроки=0;
	
	Для каждого Товар Из Товары Цикл
		ОбъектНоменклатуры=Товар.Серия.ЯССМ_ОбъектНоменклатуры;
		
		
		Если ОбъектНоменклатуры.Уникальный И 
			ОбъектНоменклатуры.Резерв <> Резерв И 
			ЗначениеЗаполнено(ОбъектНоменклатуры.Резерв) И 
			ЗначениеЗаполнено(Резерв) Тогда
			Отказ=Истина; 			
			
						
			
			ОбъектНоменклатуры_Резерв=ОбъектНоменклатуры.Резерв;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Материал: №%3 (%1) - %2 - #%4, необходимо снять с резерва: ""%5""!",
			Товар.Номенклатура.Код,
			Товар.Номенклатура,
			НомерСтроки+1,
			Формат(ОбъектНоменклатуры.НомерПоставки,"ЧДЦ=0; ЧГ="),
			ОбъектНоменклатуры_Резерв);
			Сообщение.Поле = "Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить();  				
			
		КонецЕсли;	
		НомерСтроки=НомерСтроки+1;
		
	КонецЦикла;
	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	Для каждого Товар Из Ссылка.Товары Цикл
		
		Если Товар.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный Тогда
			
			НоваяСтрТз						=	ТЗ.Добавить();			 
			НоваяСтрТз.ОбъектНоменклатуры	= 	Товар.Серия.ЯССМ_ОбъектНоменклатуры;
			
		КонецЕсли;		
	КонецЦикла;
	
	ДополнительныеСвойства.Вставить("ТЗ_ОбъектыНоменклатуры",ТЗ); 
	                                                                                                                            
	ДополнительныеСвойства.Вставить("ОтменаРезерва",
	(Режимзаписи=РежимЗаписиДокумента.ОтменаПроведения И Ссылка.Проведен) Или 
	(Режимзаписи=РежимЗаписиДокумента.Проведение И Не ЗначениеЗаполнено(Резерв) И ЗначениеЗаполнено(Ссылка.Резерв)));

	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения); 		
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Движения.Лико_РезервСерий.Записывать = Истина;

	ТЗ = ДополнительныеСвойства.ТЗ_ОбъектыНоменклатуры;
	
	Для каждого Товар Из Товары Цикл
		
		Если Товар.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный Тогда
			
			 Движение 						=	Движения.Лико_РезервСерий.Добавить();
             Движение.Период				=	Дата;
			 Движение.Серия					=	Товар.Серия;
			 Движение.Партнер				=	Партнер; 
			 Если ЗначениеЗаполнено(Резерв) Тогда
				 Движение.Резерв				=	Резерв;
				 Движение.Партнер				=	Резерв;
			 КонецЕсли;
			 Движение.ОбъектНоменклатуры	=	Товар.Серия.ЯССМ_ОбъектНоменклатуры;
			 
			НоваяСтрТз						=	ТЗ.Добавить();			 
			НоваяСтрТз.ОбъектНоменклатуры	= 	 Движение.ОбъектНоменклатуры;

			
		КонецЕсли;
		
		
	КонецЦикла; 
		
		 Движения.Лико_РезервСерий.Записать(Истина);

	
	ТЗ.Свернуть("ОбъектНоменклатуры");
	
	Справочники.ЯССМ_ОбъектыНоменклатуры.УстановитьРезерв(ТЗ.ВыгрузитьКолонку("ОбъектНоменклатуры"));
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив; 
	
	Если Не ЗначениеЗаполнено(Партнер) И  Не ЗначениеЗаполнено(Резерв) Тогда
		ПроверяемыеРеквизиты.Добавить("Комментарий");
	КонецЕсли;
	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры


Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Дата          	= ТекущаяДатаСеанса();
	Ответственный 	= Пользователи.ТекущийПользователь();
	Структура 		= Новый Структура;
	Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Структура);
	
	Если Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ЗаполнениеСотрудникаВЗаявке",Ложь) Тогда
	КонецЕсли; 
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("Структура") Тогда
		
		
		 ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		 
		 Если ДанныеЗаполнения.Свойство("МассивСерий") Тогда
			 
			 Для каждого Серия Из ДанныеЗаполнения.МассивСерий  Цикл 
				 
			НовыйТовар 					=	Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйТовар,Серия);
				 
			 	
			 КонецЦикла;
			 
		 КонецЕсли;
		 
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ТЗ = ДополнительныеСвойства.ТЗ_ОбъектыНоменклатуры;

	ТЗ.Свернуть("ОбъектНоменклатуры");
	
	 Движения.Лико_РезервСерий.Записывать=Истина;
	 Движения.Лико_РезервСерий.Записать(Истина);
	
	Справочники.ЯССМ_ОбъектыНоменклатуры.УстановитьРезерв(ТЗ.ВыгрузитьКолонку("ОбъектНоменклатуры"));

		
КонецПроцедуры


Процедура НаписатьПисьмоОтменаРезерва()
	ТабДок = Новый ТабличныйДокумент;
	
	Документы.Лико_УстановкаРезерваМатериалов.Печать(ТабДок,Ссылка);
	
	ИмяТемпФайла = ПолучитьИмяВременногоФайла();
	ТабДок.Записать(ИмяТемпФайла,ТипФайлаТабличногоДокумента.HTML5);
	ТекстHТМЛ = Новый ТекстовыйДокумент;
	ТекстHТМЛ.Прочитать(ИмяТемпФайла);
	ТекстHТМЛ = ТекстHТМЛ.ПолучитьТекст(); 					
	Текст=" Отмена резерва материалов : " ;
	Текст = Текст + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Ссылка); //+ " от " + Формат(Дата, "ДФ='дд ММММ гггг'");
	Текст = Текст + ". Объект "+ ?(ЗначениеЗаполнено(Резерв),Строка(Резерв), Строка(Партнер));
	Тема  = Текст;  
	Текст=ТекстHТМЛ;
	ТипСообщения=Справочники.Лико_ТипыСообщений.ОтменаРезерваМетериалов;
	Адресат = Справочники.Лико_ТипыСообщений.ПолучитьПочтовыеАдреса(ТипСообщения,Организация); 		
	Лико_Планирование.ОтправитьПисьмо(Текст, Тема, Адресат); 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	
	
	Если ДополнительныеСвойства.ОтменаРезерва Тогда
		
		НаписатьПисьмоОтменаРезерва(); 
		
	КонецЕсли;
	
КонецПроцедуры
